#include <stdio.h>
int main()
{
    int m, n, count, i, t;
    while (~scanf("%d%d", &m, &n))
    {
        count = 0; //统计水仙花数
        for (i = m; i <= n; i++)
        {                //范围为[m,n]，遍历范围内的数，逐个检验
            int sum = 0; // 计算立方和：从个位、十位到百位分别计算求和
            t = i;
            while (t)
            {                        //   分解整数， 例如123，对10求余得3,即得到个位数，然后把123/10=12
                int t2 = t % 10;     //   12再对10求余得2，对应十位数，12/10=1，1对10求余得1，对应百位数
                sum += t2 * t2 * t2; //水仙花的定义，每个位数的立方
                t /= 10;             // 去掉个位
            }
            // 输出结果
            if (sum == i)
            {
                if (count > 0) //格式要求，第一个数前面不需要空格，第二个开始就需要空格 例如:123 / :123 127
                    printf(" ");
                printf("%d", i);
                count++; //找到一个就记录一个
            }
        }
        // 输出结果（没有水仙花数）和换行
        if (count == 0)
            printf("no");
        printf("\n");
    }
    return 0;
}